const mapCustomError = {
	400: "Некорректный запрос",
	401: "Необходима авторизация",
	403: "Запрещено",
	404: "Страница не найдена",
	408: "Истекло время ожидания",
	413: "Слишком большая нагрузка",
	414: "Слишком длинный URI",
	429: "Слишком много запросов",
	500: "Внутреняя ошибка сервера",
	502: "Неверный шлюз",
	503: "Сервис недоступен",
	505: "Версия HTTP не поддерживается",
	520: "Неизвестная ошибка"
};

/**
 * Получение локализованного текста ошибки
 *
 * @param {number} status - статус ошибки
 * @returns {string}
 */
export const useCustomError = (status) => mapCustomError[status];
